lwfinger/rtl8723au/hal/usb_ops_linux.c
	_func_enter_;

	request = 0x05;
	requesttype = 0x01;//read_in
	index = 0;//n/a

	wvalue = (u16)(addr&0x0000ffff);
	len = 2;

	usbctrl_vendorreq(pintfhdl, request, wvalue, index, &data, len, requesttype);

	_func_exit_;

	return data;

}

static u32 usb_read32(struct intf_hdl *pintfhdl, u32 addr)
{
	u8 request;
	u8 requesttype;
	u16 wvalue;
	u16 index;
	u16 len;
	u32 data=0;

	_func_enter_;

	request = 0x05;
	requesttype = 0x01;//read_in
	index = 0;//n/a

	wvalue = (u16)(addr&0x0000ffff);
	len = 4;

	usbctrl_vendorreq(pintfhdl, request, wvalue, index, &data, len, requesttype);

	_func_exit_;

	return data;

}

static int usb_write8(struct intf_hdl *pintfhdl, u32 addr, u8 val)
{
	u8 request;
	u8 requesttype;
	u16 wvalue;
	u16 index;
	u16 len;
	u8 data;
	int ret;

	_func_enter_;

	request = 0x05;
	requesttype = 0x00;//write_out
	index = 0;//n/a

	wvalue = (u16)(addr&0x0000ffff);
	len = 1;

	data = val;

	 ret = usbctrl_vendorreq(pintfhdl, request, wvalue, index, &data, len, requesttype);

	_func_exit_;

	return ret;

}

static int usb_write16(struct intf_hdl *pintfhdl, u32 addr, u16 val)
{
	u8 request;
	u8 requesttype;
	u16 wvalue;
	u16 index;
	u16 len;
	u16 data;
	int ret;

	_func_enter_;

	request = 0x05;
	requesttype = 0x00;//write_out
	index = 0;//n/a

	wvalue = (u16)(addr&0x0000ffff);
	len = 2;

	data = val;

	ret = usbctrl_vendorreq(pintfhdl, request, wvalue, index, &data, len, requesttype);

	_func_exit_;

	return ret;

}

static int usb_write32(struct intf_hdl *pintfhdl, u32 addr, u32 val)
{
	u8 request;
	u8 requesttype;
	u16 wvalue;
	u16 index;
	u16 len;
	u32 data;
	int ret;

	_func_enter_;

	request = 0x05;
	requesttype = 0x00;//write_out
	index = 0;//n/a

	wvalue = (u16)(addr&0x0000ffff);
	len = 4;
	data = val;


	ret =usbctrl_vendorreq(pintfhdl, request, wvalue, index, &data, len, requesttype);

	_func_exit_;

	return ret;

}

static int usb_writeN(struct intf_hdl *pintfhdl, u32 addr, u32 length, u8 *pdata)
{
	u8 request;
	u8 requesttype;
	u16 wvalue;
	u16 index;
	u16 len;
	u8 buf[VENDOR_CMD_MAX_DATA_LEN]={0};
	int ret;

	_func_enter_;

	request = 0x05;
	requesttype = 0x00;//write_out
	index = 0;//n/a

	wvalue = (u16)(addr&0x0000ffff);
	len = length;
	 memcpy(buf, pdata, len );

	ret = usbctrl_vendorreq(pintfhdl, request, wvalue, index, buf, len, requesttype);

	_func_exit_;

	return ret;

}

#ifdef CONFIG_USB_INTERRUPT_IN_PIPE
#if 0
/**
* Log the Interrupt value and update counter no matter STA is associated or not. It is
* implemented for FPGA verification stage because we need to now whether the current FPGA
* platform is alive
*
* \param pAdapter			The adapter context for this minoport
* \param	IsrContent		The ISR value read from hardware in MPISR
*
* We sholud remove this function later because DDK suggest not to executing too many
* operations in MPISR
*/
void
LogInterruptHistory8723AU(
	PADAPTER			Adapter
)
{
	HAL_DATA_TYPE	*pHalData=GET_HAL_DATA(Adapter);

//	if(pHalData->IntArray[0] & IMR_COMDOK)
//		pHalData->InterruptLog.nIMR_COMDOK++;
	if(pHalData->IntArray[0] & UHIMR_VODOK)
	{
		pHalData->InterruptLog.nIMR_VODOK++;
		DBG_8723A("UHIMR_VODOK %d \n", pHalData->InterruptLog.nIMR_VODOK);
	}
	if(pHalData->IntArray[0] & UHIMR_VIDOK)
	{
		pHalData->InterruptLog.nIMR_VIDOK++;
		DBG_8723A("UHIMR_VIDOK %d\n", pHalData->InterruptLog.nIMR_VIDOK);
	}
	if(pHalData->IntArray[0] & UHIMR_MGNTDOK)
	{
		pHalData->InterruptLog.nIMR_MGNTDOK++;
		DBG_8723A("UHIMR_MGNTDOK %d\n", pHalData->InterruptLog.nIMR_MGNTDOK);
	}
	if(pHalData->IntArray[0] & UHIMR_BEDOK)
	{
		pHalData->InterruptLog.nIMR_BEDOK++;
		DBG_8723A("UHIMR_BEDOK %d\n", pHalData->InterruptLog.nIMR_BEDOK);
	}
	if(pHalData->IntArray[0] & UHIMR_BKDOK)
	{
		pHalData->InterruptLog.nIMR_BKDOK++;
		DBG_8723A("UHIMR_BKDOK %d\n", pHalData->InterruptLog.nIMR_BKDOK);
	}
	if(pHalData->IntArray[0] & UHIMR_ROK)
	{
		pHalData->InterruptLog.nIMR_ROK++;
		DBG_8723A("UHIMR_ROK %d\n", pHalData->InterruptLog.nIMR_ROK);
	}

	if(pHalData->IntArray[0] & UHIMR_TXBCNOK)
	{
		pHalData->InterruptLog.nIMR_TBDOK++;
		DBG_8723A("UHIMR_TXBCNOK %d\n", pHalData->InterruptLog.nIMR_TBDOK);
	}
	if(pHalData->IntArray[0] & UHIMR_BCNDOK0)
	{
		pHalData->InterruptLog.nIMR_BDOK++;
		DBG_8723A("UHIMR_BCNDOK0 %d\n", pHalData->InterruptLog.nIMR_BDOK);
	}
	if(pHalData->IntArray[0] & UHIMR_C2HCMD)
	{
		pHalData->InterruptLog.nIMR_C2HCMD++;
		DBG_8723A("UHIMR_C2HCMD %d\n", pHalData->InterruptLog.nIMR_C2HCMD);
	}
	if(pHalData->IntArray[0] & UHIMR_CPWM)
	{
		pHalData->InterruptLog.nIMR_C2HCMD++;
		DBG_8723A("UHIMR_CPWM %d\n", pHalData->InterruptLog.nIMR_CPWM);
	}

//	if(pHalData->IntArray[0] & IMR_RXCMDOK)
//		pHalData->InterruptLog.nIMR_RCOK++;
	if(pHalData->IntArray[0] & UHIMR_RDU)
	{
		pHalData->InterruptLog.nIMR_RDU++;
		DBG_8723A("UHIMR_RDU %d\n", pHalData->InterruptLog.nIMR_RDU);
	}

	if(pHalData->IntArray[1] & UHIMR_RXFOVW)
	{
		pHalData->InterruptLog.nIMR_RXFOVW++;
		DBG_8723A("UHIMR_RXFOVW %d\n", pHalData->InterruptLog.nIMR_RXFOVW);
	}


}
#endif
//
// Description:
//	Recognize the interrupt content by reading the interrupt register or content and masking interrupt mask (IMR)
//	if it is our NIC's interrupt. After recognizing, we may clear the all interrupts (ISR).
// Arguments:
//	[in] Adapter -
//		The adapter context.
//	[in] pContent -
//		Under PCI interface, this field is ignord.
//		Under USB interface, the content is the interrupt content pointer.
//		Under SDIO interface, this is the interrupt type which is Local interrupt or system interrupt.
//	[in] ContentLen -
//		The length in byte of pContent.
// Return:
//	If any interrupt matches the mask (IMR), return TRUE, and return FALSE otherwise.
//
bool
InterruptRecognized8723AU(
	PADAPTER			Adapter,
	void *				pContent,
	u32				ContentLen
)
{
	HAL_DATA_TYPE	*pHalData=GET_HAL_DATA(Adapter);
	u8 *			buffer = (u8 *)pContent;
//	RT_PRINT_DATA(COMP_RECV, DBG_LOUD, ("InterruptRecognized8723AU Interrupt buffer \n"), buffer, MAX_RECEIVE_INTERRUPT_BUFFER_SIZE(Adapter));

	memcpy(&(pHalData->IntArray[0]), &(buffer[USB_INTR_CONTENT_HISR_OFFSET]), 4);
//	PlatformMoveMemory(&(pHalData->IntArray[0]), &(buffer[USB_INTR_CONTENT_HISR_OFFSET]), sizeof(u4Byte));
//	DBG_8723A("InterruptRecognized8723AU HISR = 0x%x HIMR = 0x%x\n", pHalData->IntArray[0],pHalData->IntrMask[0]);
	pHalData->IntArray[0] &= pHalData->IntrMask[0];

	//For HISR extension. Added by tynli. 2009.10.07.
	memcpy(&(pHalData->IntArray[1]), &(buffer[USB_INTR_CONTENT_HISRE_OFFSET]), 4);
//	PlatformMoveMemory(&(pHalData->IntArray[1]), &(buffer[USB_INTR_CONTENT_HISRE_OFFSET]), sizeof(u4Byte));
//	DBG_8723A("InterruptRecognized8192CUsb HISRE = 0x%x HIMRE = 0x%x\n", pHalData->IntArray[1], pHalData->IntrMask[1]);
	pHalData->IntArray[1] &= pHalData->IntrMask[1];

	// We sholud remove this function later because DDK suggest not to executing too many operations in MPISR
//	if(pHalData->IntArray[0] != 0)
//		LogInterruptHistory8723AU(Adapter);

	{
		struct reportpwrstate_parm report;
		memcpy(&report.state, &(buffer[USB_INTR_CPWM_OFFSET]), 1);
#ifdef CONFIG_LPS_LCLK
		if( ((pHalData->IntArray[0])&UHIMR_CPWM)){
//			DBG_8723A("%s HIMR=0x%x\n",__func__,pHalData->IntArray[0]);
			//cpwm_int_hdl(Adapter, &report);
			schedule_work(&Adapter->pwrctrlpriv.cpwm_event);
			pHalData->IntArray[0]&= ~UHIMR_CPWM;
//			DBG_8723A("%s HIMR=0x%x\n",__func__,pHalData->IntArray[0]);
		}
#endif
	}
	return (((pHalData->IntArray[0])&pHalData->IntrMask[0])!=0 ||
		((pHalData->IntArray[1])&pHalData->IntrMask[1])!=0);

